In [1]:
import pandas
pandas.__version__

'2.0.0'

In [2]:
#Creando data frames 
import pandas as pd
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)


df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [13]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [3]:
#Creando series desde 0
ages = pd.Series([22, 35, 58], name="Age")
print(ages)
cliente = pd.Series(["si", "no" , "no"], name="Cliente")
print(cliente)
paginas = pd.Series([15,18,22,23,24,25,50], name="Paginas")
print(paginas)

df["Age"].max() #Sacando la maxima edad del dataframe
ages.max() #Sacando la edad maxima de la serie

#el metodo describe() nos da una rapida vista a los datos numericos del data frame 
df.describe()

paginas.max()
paginas.describe()

0    22
1    35
2    58
Name: Age, dtype: int64
0    si
1    no
2    no
Name: Cliente, dtype: object
0    15
1    18
2    22
3    23
4    24
5    25
6    50
Name: Paginas, dtype: int64

count     7.000000
mean     25.285714
std      11.455920
min      15.000000
25%      20.000000
50%      23.000000
75%      24.500000
max      50.000000
Name: Paginas, dtype: float64

In [30]:
#Instalando Openpyxl
#! pip install openpyxl 
#Para actualizar Openpyxl
#! python.exe -m pip install --upgrade pip

Note: you may need to restart the kernel to use updated packages.

ERROR: Can not perform a '--user' install. User site-packages are not visible in this virtualenv.

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [14]:
import pandas as pd

import openpyxl

#Cargar archivos csv
titanic = pd.read_csv("titanic.csv")
print(titanic)
#print (titanic)
print (titanic.head(8)) #Muestra las primeras 8 filas
print (titanic.dtypes) #Muestra como panda interpreta los tipos de cada columna

#Crea un archivo de excel con el data frame
titanic.to_excel("titanic.xlsx", sheet_name="passengers", index=False)

<bound method DataFrame.info of      PassengerId  Survived  Pclass
0              1         0       3  \
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp
0                              Braund, Mr. Owen Harris    male  22.0      1  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [19]:
import openpyxl
titanic = pd.read_excel("titanic.xlsx", sheet_name="passengers")
print(titanic.head())
print(titanic.info())
print(titanic.tail())

   PassengerId  Survived  Pclass
0            1         0       3  \
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp
0                            Braund, Mr. Owen Harris    male  22.0      1  \
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
     PassengerId  Survived  Pclass                                      Name
886          887         0       2                     Montvila, Rev. Juozas  \
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

In [ ]:
#Seleccionando una sub serie del data frame
import pandas as pd
import openpyxl

titanic = pd.read_csv("titanic.csv")
#print(titanic.head())

ages = titanic["Age"]
print(ages.head())

type(titanic["Age"])
titanic["Age"].shape

#Seleccionando multiples columnas
age_sex = titanic[["Age", "Sex"]]
print(age_sex.head())
type(titanic[["Age", "Sex"]])
titanic[["Name", "Age", "Sex"]].shape

#Filtrar filas especificas del dataframe
above_35 = titanic[titanic["Age"] > 35] #Valida y selecciona las filas que tengan el valor mayor a 35 en la columna Age
above_35.head()

titanic["Age"] > 35 #La condici칩n valida cual fila en la columna Age es mayor a 35

above_35.shape

#Validar si un valor se encuentra en una columna
class_23 = titanic[titanic["Pclass"].isin([2, 3])]
print(class_23.head())

#Se pueden combinar multiples declaraciones condicionales, cada condici칩n debe de estar entre parentesis 
#No se pueden usar las condiciones or/and, pero si los operadores or = | y and = & 
class_23 = titanic[(titanic["Pclass"] == 2) | (titanic["Pclass"] == 3)]
print(class_23.head())

#La funci칩n condicional notna() regresa un true por cada fila que su valor no es nulo
#Asi seleccionamos las filas de las cuales conocemos la edad de los pasajeros
age_no_na = titanic[titanic["Age"].notna()]
age_no_na.head()
age_no_na.shape

#Como seleccionar especificas filas y columnas del dataframe
#Seleccionando pasajeros mayores de 35 a침os
adult_names = titanic.loc[titanic["Age"] > 35, "Name"] #Se utiliza loc cuando se seleciona por la etiqueta
print("validando prueba")
prueba = titanic[["Age", "Sex"]]
print(prueba)
print(adult_names.head())

#Seleccionando filas de 10 al 25 y columnas 3 al 5
titanic.iloc[9:25, 2:5] #Se utiliza iloc cuando se selecciona por posiciones

#Cambiando el valor name a los datos seleccionados
#Asignando el valor anonymusa los primeros tres elementos de la tercera columna
titanic.iloc[0:3, 3] = "anonymous"
print("nombres anonimos")
print(titanic.head())

titanic.to_excel("titanic.xlsx", sheet_name="passengers", index=False)

In [2]:
#Ejemplos de uso de loc
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)
""""
# Select single Row
print(df.loc['r2'])

# Select Single Column by label
print(df.loc[:, "Courses"])

# Select Multiple Rows by Label
print(df.loc[['r2','r3']])

# Select Multiple Columns by labels
print(df.loc[:, ["Courses","Fee","Discount"]])

# Select Rows Between two Index Labels
# Includes both r1 and r4 rows
print(df.loc['r1':'r4'])

# Select Columns between two Labels
# Includes both 'Fee' and 'Discount' columns
print(df.loc[:,'Fee':'Discount'])

# Select Alternate rows By indeces
print(df.loc['r1':'r4':2])

# Select Alternate Columns between two Labels
print(df.loc[:,'Fee':'Discount':2])

# Using Conditions
print(df.loc[df['Fee'] >= 24000])
"""

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

'"\n# Select single Row\nprint(df.loc[\'r2\'])\n\n# Select Single Column by label\nprint(df.loc[:, "Courses"])\n\n# Select Multiple Rows by Label\nprint(df.loc[[\'r2\',\'r3\']])\n\n# Select Multiple Columns by labels\nprint(df.loc[:, ["Courses","Fee","Discount"]])\n\n# Select Rows Between two Index Labels\n# Includes both r1 and r4 rows\nprint(df.loc[\'r1\':\'r4\'])\n\n# Select Columns between two Labels\n# Includes both \'Fee\' and \'Discount\' columns\nprint(df.loc[:,\'Fee\':\'Discount\'])\n\n# Select Alternate rows By indeces\nprint(df.loc[\'r1\':\'r4\':2])\n\n# Select Alternate Columns between two Labels\nprint(df.loc[:,\'Fee\':\'Discount\':2])\n\n# Using Conditions\nprint(df.loc[df[\'Fee\'] >= 24000])\n'